[
    {
        "id": 1,
        "heading": "Pooran meets LSG owner Goenka; signs on dotted lines for retention",
        "summary": "Nicholas Pooran becomes the first formal signing for IPL 2025.",
        "details": "Last time an active international cricketer visited the RPSG House on the Judges' Court Road in Alipore, Kolkata, the deal could not be pulled off. This time it is a slam dunk. While the KL Rahul deal did not come off, Nicholas Pooran clinched it.\n\nCricbuzz can confirm that Pooran (29) was in the Kolkata office of the RPSG group on Tuesday to meet owner Sanjiv Goenka. He signed on the dotted lines to represent Lucknow Super Giants (LSG) in the coming seasons. The West Indian may now have become the first formal signing of the Indian Premier League (IPL) season 2025.\n\nHe will be the franchise's primary retention, commanding a price of Rs 18 crore, the price slab prescribed by the Board of Control for Cricket in India (BCCI), for the No. 1 retention. Although the franchise can pay more or less, it has been learnt he will have a salary of Rs 18 crore.\n\nHis last auction price was Rs 16 crore, bought by the franchise in the 2023 auction in Dubai, after SunRisers Hyderabad had released him. The Rs 2 crore uplift is not a bad deal for a foreign player ahead of a mega auction. Normally, Indian players get big bucks in the big IPL auction.\n\n\"Pooran is committed to LSG, possesses a winning mindset, thinks deep and above all he is adaptable to the batting order and any match situation,\" said an LSG official explaining the signing.\n\nPooran was one of the high performing players for the franchise in the last IPL. Reaching 500 runs in a season is widely considered a commendable feat in the IPL and Pooran was not too far away from the benchmark. He scored 499 runs, including three half centuries with 35 fours and 36 sixes. Considering that he is also a decent wicketkeeper, the signing looks a win-win for both parties.\n\nIt has already been reported that the franchise has decided not to retain Rahul and Pooran will be one of the five retentions by the franchise and as previously reported by Cricbuzz, Ravi Bishnoi, Mayank Yadav, Ayush Badoni and Mohsin Khan, last two named uncapped, are the other players who will stay with Lucknow.\n\nThe SuperGiants will go into the auction with a purse of Rs 69 crore, having spent Rs 51 crore from a permitted salary cap of Rs 120 crore on the five retentions - Rs 18 crore for the first, Rs 14 crore for the second, Rs 11 crore for the third with Rs 4 crore each for the two uncapped players. They will have to buy at least 15 more from the remaining purse and that should be enough to build a strong team.",
        "image": "https://i.ibb.co/JdLp2dc/image.png",
        "timestamp": "2024-10-29T12:00:00Z",
        "reportedBy": "Alhem Ali"
    },
    {
        "id": 2,
        "heading": "Sri Lanka set to host men's T10 competition in December",
        "summary": "The tournament is slated for an 11-day window between the end of the second Test in South Africa, and the start of a white-ball series in New Zealand in late December.",
        "details": "Sri Lanka is set to host its first men's T10 competition between December 12 and 22, according to a board release. SLC has long harboured aspirations of hosting a T10 tournament, though many of the previous plans had revolved around women's cricket.\n\nBut with a partner - T Ten Global Sports - now involved, the board is confident it will get a T10 tournament off the ground in December, for the men. For now, the plan is for a draft to take place on November 10, and for six franchises to take part - one more franchise than has played in the five iterations of the Lanka Premier League, which is Sri Lanka's top T20 competition. Overseas players are expected to be involved.\n\n\"I am confident that the first ever draft of the Lanka T10 Super League is going to set the platform for an exciting and entertaining tournament, which will add color to the Sri Lankan cricketing calendar and bring in a new experience to our players and fans, alike,\" SLC president Shammi Silva said in the release.\n\nWith T Ten Global Sports also running ventures in Zimbabwe and West Indies, the draft's later rounds will involve selecting an emerging player from either of those nations.\n\nThe T10 tournament is slated for an 11-day window between the end of the second Test in South Africa, and the start of a white-ball series in New Zealand in late December. As such, most - if not all - of Sri Lanka's top men's players should be available for this tournament.",
        "image": "https://i.ibb.co.com/nrq1RjX/image.png",
        "timestamp": "2024-11-01T10:00:00Z",
        "reportedBy": "John Doe"
    },

    
        {
            "id": 3,
            "heading": "NCL round-up: Rakibul, Mridha guide Dhaka Metropolis to victory over Rajshahi",
            "summary": "Sylhet, meanwhile, successfully chased down 220 against Chattogram despite falling behind in the first innings.",
            "details": "Dhaka Metropolis thumped Rajshahi Division by ten wickets to start the NCL with successive wins. Left-arm spinner Rakibul Hasan took career-best figures of 8 for 56 in the second innings, and combined with young left-arm quick Maruf Mridha, who had bagged 6 for 22 in the first, to sink Rajshahi.\n\nAsked to bat first, Rajshahi were bowled out for 77, with No. 10 Mohor Sheikh top-scoring with 19, as Mridha, Abu Haider, and Anisul Islam Emon shared the ten wickets.\n\nDhaka Metropolis replied with 233, as Shamsur Rahman, playing his 150th first-class match, top-scored with 64. Rajshahi were then shot out for 166, as Rakibul ran through their line-up. Dhaka Metropolis then got the required 14 runs in 2.1 overs.\n\nPinak Ghosh's unbeaten 62 led Sylhet Division to a six-wicket win against Chattogram Division in a low-scoring game. The left-hander took only 81 balls to get his runs in the 220-run chase, guiding Sylhet to their first win this season. The hosts reached the target in 40.1 overs, with Tawfique Khan also hitting a fifty.\n\nEarlier, Sylhet had fallen behind by 46 runs after they were bowled out for 152 in reply to Chattogram's 198 in the first innings. Yasir Ali contributed the most runs for Chattogram as he scored 73, and that was followed by Ifran Hossain's five-wicket haul, which kept Sylhet under pressure. Chattogram, however, couldn't build on the first-innings lead, as they were bowled out for 173 in their second dig. Nayeem Ahmed and Rejaur Rahman took three wickets each for Sylhet.",
            "image": "https://i.ibb.co.com/9qW11QW/image.png",
            "timestamp": "2024-11-01T14:00:00Z",
            "reportedBy": "Jane Smith"
        }
    
    
]
